kamocat/circuitpython/ports/raspberrypi/common-hal/sdioio/rp2350_sdio.c
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2021 Carl Kugler III
// SPDX-FileCopyrightText: Copyright (c) 2025 CircuitPython Contributors
//
// SPDX-License-Identifier: Apache-2.0
//
// RP2350 SDIO transport layer — PIO + DMA implementation.
// Derived from carlk3/no-OS-FatFS-SD-SDIO-SPI-RPi-Pico (Apache-2.0):
//   https://github.com/carlk3/no-OS-FatFS-SD-SDIO-SPI-RPi-Pico
// Modifications: adapted for RP2350, restructured as a stateless module
// with CircuitPython pin/DMA allocation conventions, removed FatFS and
// host-specific dependencies, renamed symbols to rp2350_sdio_* prefix.

#include <string.h>
#include <assert.h>

#include "hardware/dma.h"
#include "hardware/gpio.h"
#include "hardware/pio.h"
#include "hardware/clocks.h"
#include "py/runtime.h"

#include "shared-bindings/time/__init__.h"

#include "rp2350_sdio.h"
#include "rp2350_sdio.pio.h"

// ---------------------------------------------------------------------------
// Timing helpers
// ---------------------------------------------------------------------------

static inline uint64_t sdio_millis(void) {
    return common_hal_time_monotonic_ms();
}

#define SDIO_TIMEOUT_CMD_MS   500u
#define SDIO_TIMEOUT_DATA_MS  2000u
#define SDIO_TIMEOUT_WRITE_MS 5000u

// ---------------------------------------------------------------------------
// CRC-7 lookup table (used in command packets).
// ---------------------------------------------------------------------------

static const uint8_t crc7_table[256] = {
    0x00, 0x12, 0x24, 0x36, 0x48, 0x5a, 0x6c, 0x7e, 0x90, 0x82, 0xb4, 0xa6, 0xd8, 0xca, 0xfc, 0xee,
    0x32, 0x20, 0x16, 0x04, 0x7a, 0x68, 0x5e, 0x4c, 0xa2, 0xb0, 0x86, 0x94, 0xea, 0xf8, 0xce, 0xdc,
    0x64, 0x76, 0x40, 0x52, 0x2c, 0x3e, 0x08, 0x1a, 0xf4, 0xe6, 0xd0, 0xc2, 0xbc, 0xae, 0x98, 0x8a,
    0x56, 0x44, 0x72, 0x60, 0x1e, 0x0c, 0x3a, 0x28, 0xc6, 0xd4, 0xe2, 0xf0, 0x8e, 0x9c, 0xaa, 0xb8,
    0xc8, 0xda, 0xec, 0xfe, 0x80, 0x92, 0xa4, 0xb6, 0x58, 0x4a, 0x7c, 0x6e, 0x10, 0x02, 0x34, 0x26,
    0xfa, 0xe8, 0xde, 0xcc, 0xb2, 0xa0, 0x96, 0x84, 0x6a, 0x78, 0x4e, 0x5c, 0x22, 0x30, 0x06, 0x14,
    0xac, 0xbe, 0x88, 0x9a, 0xe4, 0xf6, 0xc0, 0xd2, 0x3c, 0x2e, 0x18, 0x0a, 0x74, 0x66, 0x50, 0x42,
    0x9e, 0x8c, 0xba, 0xa8, 0xd6, 0xc4, 0xf2, 0xe0, 0x0e, 0x1c, 0x2a, 0x38, 0x46, 0x54, 0x62, 0x70,
    0x82, 0x90, 0xa6, 0xb4, 0xca, 0xd8, 0xee, 0xfc, 0x12, 0x00, 0x36, 0x24, 0x5a, 0x48, 0x7e, 0x6c,
    0xb0, 0xa2, 0x94, 0x86, 0xf8, 0xea, 0xdc, 0xce, 0x20, 0x32, 0x04, 0x16, 0x68, 0x7a, 0x4c, 0x5e,
    0xe6, 0xf4, 0xc2, 0xd0, 0xae, 0xbc, 0x8a, 0x98, 0x76, 0x64, 0x52, 0x40, 0x3e, 0x2c, 0x1a, 0x08,
    0xd4, 0xc6, 0xf0, 0xe2, 0x9c, 0x8e, 0xb8, 0xaa, 0x44, 0x56, 0x60, 0x72, 0x0c, 0x1e, 0x28, 0x3a,
    0x4a, 0x58, 0x6e, 0x7c, 0x02, 0x10, 0x26, 0x34, 0xda, 0xc8, 0xfe, 0xec, 0x92, 0x80, 0xb6, 0xa4,
    0x78, 0x6a, 0x5c, 0x4e, 0x30, 0x22, 0x14, 0x06, 0xe8, 0xfa, 0xcc, 0xde, 0xa0, 0xb2, 0x84, 0x96,
    0x2e, 0x3c, 0x0a, 0x18, 0x66, 0x74, 0x42, 0x50, 0xbe, 0xac, 0x9a, 0x88, 0xf6, 0xe4, 0xd2, 0xc0,
    0x1c, 0x0e, 0x38, 0x2a, 0x54, 0x46, 0x70, 0x62, 0x8c, 0x9e, 0xa8, 0xba, 0xc4, 0xd6, 0xe0, 0xf2
};

// ---------------------------------------------------------------------------
// CRC-16 over 4 parallel data lines.
// ---------------------------------------------------------------------------

__attribute__((optimize("Ofast")))
static uint64_t sdio_crc16_4bit(const uint32_t *data, uint32_t num_words) {
    uint64_t crc = 0;
    const uint32_t *end = data + num_words;
    while (data < end) {
        for (int i = 0; i < 4; i++) {
            uint32_t data_in = __builtin_bswap32(*data++);
            uint32_t data_out = (uint32_t)(crc >> 32);
            crc <<= 32;
            data_out ^= data_out >> 16;
            data_out ^= data_in >> 16;
            uint64_t xorred = data_out ^ data_in;
            crc ^= xorred;
            crc ^= xorred << (5 * 4);
            crc ^= xorred << (12 * 4);
        }
    }
    return crc;
}

// ---------------------------------------------------------------------------
// Send a command frame to the CMD SM TX FIFO.
// ---------------------------------------------------------------------------

static void sdio_send_command(rp2350_sdio_state_t *s,
    uint8_t command, uint32_t arg, uint8_t response_bits) {
    // Build two 32-bit words that match the PIO TX FIFO format:
    //   word0[31:24] = 47 (total cmd bits - 1)
    //   word0[23:22] = 0b01 (start + direction bit = 1 for host→card)
    //   word0[21:16] = command index
    //   word0[15:08] = arg[31:24]
    //   word0[07:00] = arg[23:16]
    //   word1[31:24] = arg[15:8]
    //   word1[23:16] = arg[7:0]
    //   word1[15:08] = CRC7 << 1 | 1 (end bit)
    //   word1[07:00] = response_bits - 1 (or 0 if no response)
    uint32_t word0 =
        (47u << 24) |
        (1u << 22) |
        ((uint32_t)command << 16) |
        (((arg >> 24) & 0xFF) << 8) |
        (((arg >> 16) & 0xFF) << 0);

    uint32_t word1 =
        (((arg >> 8) & 0xFF) << 24) |
        (((arg >> 0) & 0xFF) << 16) |
        (1u << 8); // end bit

    if (response_bits) {
        word1 |= (uint32_t)(response_bits - 1);
    }

    // CRC over the bytes that will be sent (big-endian order).
    uint8_t crc = 0;
    crc = crc7_table[crc ^ ((word0 >> 16) & 0xFF)];
    crc = crc7_table[crc ^ ((word0 >> 8) & 0xFF)];
    crc = crc7_table[crc ^ ((word0 >> 0) & 0xFF)];
    crc = crc7_table[crc ^ ((word1 >> 24) & 0xFF)];
    crc = crc7_table[crc ^ ((word1 >> 16) & 0xFF)];
    // Insert CRC into word1[15:8]: CRC value in bits [7:1], end-bit in bit 0.
    word1 = (word1 & 0xFFFF00FFu) | ((uint32_t)(crc | 1) << 8);

    pio_sm_clear_fifos(s->pio, s->cmd_sm);
    pio_sm_put(s->pio, s->cmd_sm, word0);
    pio_sm_put(s->pio, s->cmd_sm, word1);
}

// ---------------------------------------------------------------------------
// Command helpers
// ---------------------------------------------------------------------------

sdio_status_t rp2350_sdio_command_R1(rp2350_sdio_state_t *s,
    uint8_t command, uint32_t arg, uint32_t *response) {
    sdio_send_command(s, command, arg, response ? 48 : 0);

    uint32_t wait_words = response ? 2u : 1u;
    uint64_t deadline = sdio_millis() + SDIO_TIMEOUT_CMD_MS;
    while (pio_sm_get_rx_fifo_level(s->pio, s->cmd_sm) < wait_words) {
        if (sdio_millis() > deadline) {
            pio_sm_clear_fifos(s->pio, s->cmd_sm);
            pio_sm_exec(s->pio, s->cmd_sm,
                pio_encode_jmp(s->pio_cmd_clk_offset));
            return SDIO_ERR_RESPONSE_TIMEOUT;
        }
    }

