kamocat/circuitpython/ports/raspberrypi/common-hal/sdioio/rp2350_sdio.c
    if (response) {
        uint32_t resp0 = pio_sm_get(s->pio, s->cmd_sm);
        uint32_t resp1 = pio_sm_get(s->pio, s->cmd_sm);

        uint8_t crc = 0;
        crc = crc7_table[crc ^ ((resp0 >> 24) & 0xFF)];
        crc = crc7_table[crc ^ ((resp0 >> 16) & 0xFF)];
        crc = crc7_table[crc ^ ((resp0 >> 8) & 0xFF)];
        crc = crc7_table[crc ^ ((resp0 >> 0) & 0xFF)];
        crc = crc7_table[crc ^ ((resp1 >> 8) & 0xFF)];
        uint8_t actual_crc = (uint8_t)(resp1 >> 0) & 0xFE;
        if (crc != actual_crc) {
            return SDIO_ERR_RESPONSE_CRC;
        }

        uint8_t resp_cmd = (uint8_t)(resp0 >> 24);
        // ACMD41 is a special case: response command code is 0x3F (R3 format).
        if (resp_cmd != command && command != 41) {
            return SDIO_ERR_RESPONSE_CODE;
        }

        *response = (uint32_t)(((resp0 & 0xFFFFFF) << 8) | ((resp1 >> 8) & 0xFF));
    } else {
        pio_sm_get(s->pio, s->cmd_sm); // consume dummy marker
    }
    return SDIO_OK;
}

sdio_status_t rp2350_sdio_command_R3(rp2350_sdio_state_t *s,
    uint8_t command, uint32_t arg, uint32_t *response) {
    // R3 has no CRC — send with 48 response bits, skip CRC check.
    sdio_send_command(s, command, arg, 48);

    uint64_t deadline = sdio_millis() + SDIO_TIMEOUT_CMD_MS;
    while (pio_sm_get_rx_fifo_level(s->pio, s->cmd_sm) < 2) {
        if (sdio_millis() > deadline) {
            pio_sm_clear_fifos(s->pio, s->cmd_sm);
            pio_sm_exec(s->pio, s->cmd_sm,
                pio_encode_jmp(s->pio_cmd_clk_offset));
            return SDIO_ERR_RESPONSE_TIMEOUT;
        }
    }
    uint32_t resp0 = pio_sm_get(s->pio, s->cmd_sm);
    uint32_t resp1 = pio_sm_get(s->pio, s->cmd_sm);
    if (response) {
        *response = (uint32_t)(((resp0 & 0xFFFFFF) << 8) | ((resp1 >> 8) & 0xFF));
    }
    return SDIO_OK;
}

sdio_status_t rp2350_sdio_command_R2(rp2350_sdio_state_t *s,
    uint8_t command, uint32_t arg, uint8_t *response) {
    // R2 is 136 bits.  Use DMA to receive 5 words (160 bits, PIO pads to 32-bit boundaries).
    pio_sm_clear_fifos(s->pio, s->cmd_sm);

    uint32_t response_buf[5] = {0};
    dma_channel_config cfg = dma_channel_get_default_config((uint)s->dma_ch);
    channel_config_set_transfer_data_size(&cfg, DMA_SIZE_32);
    channel_config_set_read_increment(&cfg, false);
    channel_config_set_write_increment(&cfg, true);
    channel_config_set_dreq(&cfg, pio_get_dreq(s->pio, s->cmd_sm, false));
    dma_channel_configure((uint)s->dma_ch, &cfg,
        response_buf, &s->pio->rxf[s->cmd_sm], 5, true);

    sdio_send_command(s, command, arg, 136);

    uint64_t deadline = sdio_millis() + SDIO_TIMEOUT_CMD_MS;
    while (dma_channel_is_busy((uint)s->dma_ch)) {
        if (sdio_millis() > deadline) {
            dma_channel_abort((uint)s->dma_ch);
            pio_sm_clear_fifos(s->pio, s->cmd_sm);
            pio_sm_exec(s->pio, s->cmd_sm,
                pio_encode_jmp(s->pio_cmd_clk_offset));
            return SDIO_ERR_RESPONSE_TIMEOUT;
        }
    }
    dma_channel_abort((uint)s->dma_ch);

    // Unpack 16 response bytes from the 5-word buffer.
    response[ 0] = (response_buf[0] >> 16) & 0xFF;
    response[ 1] = (response_buf[0] >> 8) & 0xFF;
    response[ 2] = (response_buf[0] >> 0) & 0xFF;
    response[ 3] = (response_buf[1] >> 24) & 0xFF;
    response[ 4] = (response_buf[1] >> 16) & 0xFF;
    response[ 5] = (response_buf[1] >> 8) & 0xFF;
    response[ 6] = (response_buf[1] >> 0) & 0xFF;
    response[ 7] = (response_buf[2] >> 24) & 0xFF;
    response[ 8] = (response_buf[2] >> 16) & 0xFF;
    response[ 9] = (response_buf[2] >> 8) & 0xFF;
    response[10] = (response_buf[2] >> 0) & 0xFF;
    response[11] = (response_buf[3] >> 24) & 0xFF;
    response[12] = (response_buf[3] >> 16) & 0xFF;
    response[13] = (response_buf[3] >> 8) & 0xFF;
    response[14] = (response_buf[3] >> 0) & 0xFF;
    response[15] = (response_buf[4] >> 0) & 0xFF;

    // Validate CRC.
    uint8_t crc = 0;
    for (int i = 0; i < 15; i++) {
        crc = crc7_table[crc ^ response[i]];
    }
    uint8_t actual_crc = response[15] & 0xFE;
    if (crc != actual_crc) {
        return SDIO_ERR_RESPONSE_CRC;
    }
    // R2 always returns command code 0x3F.
    if ((response_buf[0] >> 24) != 0x3F) {
        return SDIO_ERR_RESPONSE_CODE;
    }
    return SDIO_OK;
}

// ---------------------------------------------------------------------------
// Multi-block DMA read
// ---------------------------------------------------------------------------

sdio_status_t rp2350_sdio_rx_start(rp2350_sdio_state_t *s,
    uint8_t *buf, uint32_t num_blocks) {
    assert(((uintptr_t)buf & 3) == 0);
    assert(num_blocks > 0 && num_blocks <= RP2350_SDIO_MAX_BLOCKS);

    s->transfer_state = SDIO_TRANSFER_RX;
    s->transfer_start_ms = sdio_millis();
    s->data_buf = (uint32_t *)buf;
    s->blocks_done = 0;
    s->total_blocks = num_blocks;
    s->blocks_checksumed = 0;
    s->checksum_errors = 0;

    // Build DMA control-block descriptors:
    //   entry [i*2]   → 512-byte data payload
    //   entry [i*2+1] → 8-byte CRC (2 words)
    for (uint32_t i = 0; i < num_blocks; i++) {
        s->dma_blocks[i * 2].write_addr = (uint32_t *)(buf + i * RP2350_SDIO_BLOCK_SIZE);
        s->dma_blocks[i * 2].transfer_count = RP2350_SDIO_WORDS_PER_BLOCK;
        s->dma_blocks[i * 2 + 1].write_addr = &s->received_checksums[i].top;
        s->dma_blocks[i * 2 + 1].transfer_count = 2;
    }
    // Sentinel — zero count stops the chain.
    s->dma_blocks[num_blocks * 2].write_addr = NULL;
    s->dma_blocks[num_blocks * 2].transfer_count = 0;

    // Primary DMA channel: PIO RX FIFO → user buffer.
    // Byte-swap to restore network byte order.
    dma_channel_config cfg = dma_channel_get_default_config((uint)s->dma_ch);
    channel_config_set_transfer_data_size(&cfg, DMA_SIZE_32);
    channel_config_set_read_increment(&cfg, false);
    channel_config_set_write_increment(&cfg, true);
    channel_config_set_dreq(&cfg, pio_get_dreq(s->pio, s->data_sm, false));
    channel_config_set_bswap(&cfg, true);
    channel_config_set_chain_to(&cfg, (uint)s->dma_chb);
    dma_channel_configure((uint)s->dma_ch, &cfg,
        NULL, &s->pio->rxf[s->data_sm], 0, false);

    // Secondary DMA channel: reconfigures the primary channel.
    // Reads pairs of words (write_addr + transfer_count) from dma_blocks[].
    // ring=3 means wrap at 8-byte boundary (one descriptor = 2 × uint32).
    dma_channel_config cfgb = dma_channel_get_default_config((uint)s->dma_chb);
    channel_config_set_transfer_data_size(&cfgb, DMA_SIZE_32);
    channel_config_set_read_increment(&cfgb, true);
    channel_config_set_write_increment(&cfgb, true);
    channel_config_set_ring(&cfgb, true, 3); // wrap write at 8 bytes (al1 pair)
    dma_channel_configure((uint)s->dma_chb, &cfgb,
        &dma_hw->ch[s->dma_ch].al1_write_addr,
        s->dma_blocks, 2, false);

    // Configure data SM for reception.
    pio_sm_init(s->pio, s->data_sm, s->pio_data_rx_offset, &s->pio_cfg_data_rx);
    pio_sm_set_consecutive_pindirs(s->pio, s->data_sm, s->d0_gpio, 4, false);

    // Load nibble count into Y: block_size_bytes * 2 nibbles + 16 CRC nibbles - 1.
    uint32_t nibble_count = RP2350_SDIO_BLOCK_SIZE * 2 + 16 - 1;
    pio_sm_put(s->pio, s->data_sm, nibble_count);
    pio_sm_exec(s->pio, s->data_sm, pio_encode_out(pio_y, 32));

    // Join RX FIFO for deeper buffering during DMA block switching.
    s->pio->sm[s->data_sm].shiftctrl |= PIO_SM0_SHIFTCTRL_FJOIN_RX_BITS;

    // Start control DMA first, then enable PIO SM.
    dma_channel_start((uint)s->dma_chb);
    pio_sm_set_enabled(s->pio, s->data_sm, true);
    return SDIO_OK;
}

static void sdio_verify_rx_checksums(rp2350_sdio_state_t *s, uint32_t maxcount) {
    while (s->blocks_checksumed < s->blocks_done && maxcount-- > 0) {
        uint32_t idx = s->blocks_checksumed++;
        uint64_t calculated = sdio_crc16_4bit(
            s->data_buf + idx * RP2350_SDIO_WORDS_PER_BLOCK,
            RP2350_SDIO_WORDS_PER_BLOCK);
        uint32_t top = __builtin_bswap32(s->received_checksums[idx].top);
        uint32_t bottom = __builtin_bswap32(s->received_checksums[idx].bottom);
        uint64_t expected = ((uint64_t)top << 32) | bottom;
        if (calculated != expected) {
            s->checksum_errors++;
        }
    }
}

sdio_status_t rp2350_sdio_rx_poll(rp2350_sdio_state_t *s) {
    // Use the control-channel read pointer to compute how many blocks are done.
    uint32_t ctrl_count =
        (dma_hw->ch[s->dma_chb].read_addr - (uintptr_t)s->dma_blocks)
        / sizeof(s->dma_blocks[0]);
    s->blocks_done = (ctrl_count > 0) ? (ctrl_count - 1) / 2 : 0;

    sdio_verify_rx_checksums(s, 4);

    if (s->blocks_done >= s->total_blocks) {
        s->transfer_state = SDIO_TRANSFER_IDLE;
        pio_sm_set_enabled(s->pio, s->data_sm, false);
        sdio_verify_rx_checksums(s, s->total_blocks);
        return (s->checksum_errors == 0) ? SDIO_OK : SDIO_ERR_DATA_CRC;
    }

    if (sdio_millis() - s->transfer_start_ms >= SDIO_TIMEOUT_DATA_MS) {
        rp2350_sdio_stop(s);
        return SDIO_ERR_DATA_TIMEOUT;
    }
    return SDIO_BUSY;
}

// ---------------------------------------------------------------------------
// Multi-block DMA write
// ---------------------------------------------------------------------------

static void sdio_start_block_tx(rp2350_sdio_state_t *s) {
    pio_sm_init(s->pio, s->data_sm, s->pio_data_tx_offset, &s->pio_cfg_data_tx);

    // Primary DMA: send 512 bytes of payload.
    dma_channel_config cfg = dma_channel_get_default_config((uint)s->dma_ch);
    channel_config_set_transfer_data_size(&cfg, DMA_SIZE_32);
    channel_config_set_read_increment(&cfg, true);
    channel_config_set_write_increment(&cfg, false);
    channel_config_set_dreq(&cfg, pio_get_dreq(s->pio, s->data_sm, true));
    channel_config_set_bswap(&cfg, true);
    channel_config_set_chain_to(&cfg, (uint)s->dma_chb);
    dma_channel_configure((uint)s->dma_ch, &cfg,
        &s->pio->txf[s->data_sm],
        s->data_buf + s->blocks_done * RP2350_SDIO_WORDS_PER_BLOCK,
        RP2350_SDIO_WORDS_PER_BLOCK, false);

    // Build end-token buffer: [CRC_high, CRC_low, 0xFFFFFFFF].
    uint64_t crc = s->next_wr_block_checksum;
    s->end_token_buf[0] = (uint32_t)(crc >> 32);
    s->end_token_buf[1] = (uint32_t)(crc >> 0);
    s->end_token_buf[2] = 0xFFFFFFFFu;

    // Secondary DMA: send CRC + end token.
    dma_channel_config cfgb = dma_channel_get_default_config((uint)s->dma_chb);
    channel_config_set_transfer_data_size(&cfgb, DMA_SIZE_32);
    channel_config_set_read_increment(&cfgb, true);
    channel_config_set_write_increment(&cfgb, false);
    channel_config_set_dreq(&cfgb, pio_get_dreq(s->pio, s->data_sm, true));
    channel_config_set_bswap(&cfgb, false);
    dma_channel_configure((uint)s->dma_chb, &cfgb,
        &s->pio->txf[s->data_sm],
        s->end_token_buf, 3, false);

