kamocat/circuitpython/ports/raspberrypi/common-hal/sdioio/rp2350_sdio.c
    // Load X (nibble count) and Y (response bit count) into SM.
    pio_sm_put(s->pio, s->data_sm, 1048); // 512*2 + 24 CRC nibbles
    pio_sm_exec(s->pio, s->data_sm, pio_encode_out(pio_x, 32));
    pio_sm_put(s->pio, s->data_sm, 31);   // 32 response bits
    pio_sm_exec(s->pio, s->data_sm, pio_encode_out(pio_y, 32));

    // Set D0-D3 high and as outputs before starting.
    pio_sm_exec(s->pio, s->data_sm, pio_encode_set(pio_pins, 15));
    pio_sm_exec(s->pio, s->data_sm, pio_encode_set(pio_pindirs, 15));

    // Write start token (0xFFFFFFF0 = start-bit followed by zeros on all 4 lines).
    pio_sm_put(s->pio, s->data_sm, 0xFFFFFFF0u);

    dma_channel_start((uint)s->dma_ch);
    pio_sm_set_enabled(s->pio, s->data_sm, true);
}

static void sdio_compute_tx_checksum(rp2350_sdio_state_t *s) {
    assert(s->blocks_checksumed < s->total_blocks);
    uint32_t idx = s->blocks_checksumed++;
    s->next_wr_block_checksum = sdio_crc16_4bit(
        s->data_buf + idx * RP2350_SDIO_WORDS_PER_BLOCK,
        RP2350_SDIO_WORDS_PER_BLOCK);
}

sdio_status_t rp2350_sdio_tx_start(rp2350_sdio_state_t *s,
    const uint8_t *buf, uint32_t num_blocks) {
    assert(((uintptr_t)buf & 3) == 0);
    assert(num_blocks > 0 && num_blocks <= RP2350_SDIO_MAX_BLOCKS);

    s->transfer_state = SDIO_TRANSFER_TX;
    s->transfer_start_ms = sdio_millis();
    s->data_buf = (uint32_t *)buf;
    s->blocks_done = 0;
    s->total_blocks = num_blocks;
    s->blocks_checksumed = 0;
    s->checksum_errors = 0;
    s->wr_status = SDIO_OK;

    sdio_compute_tx_checksum(s);
    sdio_start_block_tx(s);
    if (s->blocks_checksumed < s->total_blocks) {
        sdio_compute_tx_checksum(s);
    }
    return SDIO_OK;
}

static sdio_status_t check_write_response(uint32_t card_response) {
    uint32_t resp = card_response;
    if (!(~resp & 0xFFFF0000u)) {
        resp <<= 16;
    }
    if (!(~resp & 0xFF000000u)) {
        resp <<= 8;
    }
    if (!(~resp & 0xF0000000u)) {
        resp <<= 4;
    }
    if (!(~resp & 0xC0000000u)) {
        resp <<= 2;
    }
    if (!(~resp & 0x80000000u)) {
        resp <<= 1;
    }
    uint32_t wr_status = (resp >> 28) & 7;
    if (wr_status == 2) {
        return SDIO_OK;
    }
    if (wr_status == 5) {
        return SDIO_ERR_WRITE_CRC;
    }
    return SDIO_ERR_WRITE_FAIL;
}

// Drive the TX state machine forward.  Called in poll loop.
static void sdio_tx_fsm(rp2350_sdio_state_t *s) {
    if (s->transfer_state == SDIO_TRANSFER_TX) {
        if (!dma_channel_is_busy((uint)s->dma_ch) &&
            !dma_channel_is_busy((uint)s->dma_chb)) {
            s->transfer_state = SDIO_TRANSFER_TX_WAIT_IDLE;
            if (!pio_sm_is_rx_fifo_empty(s->pio, s->data_sm)) {
                s->card_response = pio_sm_get(s->pio, s->data_sm);
            } else {
                // Set up DMA to wait for the card response in the RX FIFO.
                dma_channel_config cfgb = dma_channel_get_default_config((uint)s->dma_chb);
                channel_config_set_transfer_data_size(&cfgb, DMA_SIZE_32);
                channel_config_set_read_increment(&cfgb, false);
                channel_config_set_write_increment(&cfgb, false);
                channel_config_set_dreq(&cfgb, pio_get_dreq(s->pio, s->data_sm, false));
                dma_channel_configure((uint)s->dma_chb, &cfgb,
                    &s->card_response, &s->pio->rxf[s->data_sm], 1, true);
            }
        }
    }

    if (s->transfer_state == SDIO_TRANSFER_TX_WAIT_IDLE) {
        if (!dma_channel_is_busy((uint)s->dma_chb)) {
            s->wr_status = check_write_response(s->card_response);
            if (s->wr_status != SDIO_OK) {
                rp2350_sdio_stop(s);
                return;
            }
            s->blocks_done++;
            if (s->blocks_done < s->total_blocks) {
                sdio_start_block_tx(s);
                s->transfer_state = SDIO_TRANSFER_TX;
                if (s->blocks_checksumed < s->total_blocks) {
                    sdio_compute_tx_checksum(s);
                }
            } else {
                rp2350_sdio_stop(s);
            }
        }
    }
}

sdio_status_t rp2350_sdio_tx_poll(rp2350_sdio_state_t *s) {
    sdio_tx_fsm(s);

    if (s->transfer_state == SDIO_TRANSFER_IDLE) {
        return s->wr_status;
    }
    if (sdio_millis() - s->transfer_start_ms >= SDIO_TIMEOUT_WRITE_MS) {
        rp2350_sdio_stop(s);
        return SDIO_ERR_DATA_TIMEOUT;
    }
    return SDIO_BUSY;
}

// ---------------------------------------------------------------------------
// Stop / abort
// ---------------------------------------------------------------------------

sdio_status_t rp2350_sdio_stop(rp2350_sdio_state_t *s) {
    dma_channel_abort((uint)s->dma_ch);
    dma_channel_abort((uint)s->dma_chb);
    pio_sm_set_enabled(s->pio, s->data_sm, false);
    pio_sm_set_consecutive_pindirs(s->pio, s->data_sm, s->d0_gpio, 4, false);
    s->transfer_state = SDIO_TRANSFER_IDLE;
    return SDIO_OK;
}

// ---------------------------------------------------------------------------
// Clock divider update
// ---------------------------------------------------------------------------

void rp2350_sdio_set_clkdiv(rp2350_sdio_state_t *s, float clk_div) {
    s->clk_div = clk_div;
    pio_sm_set_clkdiv(s->pio, s->cmd_sm, clk_div);
    // data SM picks up the new divider on the next pio_sm_init() call.
}

// ---------------------------------------------------------------------------
// Initialise
// ---------------------------------------------------------------------------

bool rp2350_sdio_init(rp2350_sdio_state_t *s, uint clk_gpio, uint cmd_gpio,
    uint d0_gpio, float clk_div) {
    if (!s->resources_claimed) {
        if (!s->pio) {
            s->pio = pio0;
        }
        s->cmd_sm = (uint)pio_claim_unused_sm(s->pio, true);
        s->data_sm = (uint)pio_claim_unused_sm(s->pio, true);
        s->dma_ch = dma_claim_unused_channel(true);
        s->dma_chb = dma_claim_unused_channel(true);
        s->resources_claimed = true;
    }

    s->clk_gpio = clk_gpio;
    s->cmd_gpio = cmd_gpio;
    s->d0_gpio = d0_gpio;
    s->clk_div = clk_div;

    dma_channel_abort((uint)s->dma_ch);
    dma_channel_abort((uint)s->dma_chb);
    pio_sm_set_enabled(s->pio, s->cmd_sm,  false);
    pio_sm_set_enabled(s->pio, s->data_sm, false);

    // Load PIO programs.  Clear instruction memory so we can share the PIO.
    pio_clear_instruction_memory(s->pio);

    // CMD+CLK state machine.
    s->pio_cmd_clk_offset = pio_add_program(s->pio, &sdio_cmd_clk_program);
    pio_sm_config cfg = sdio_cmd_clk_program_get_default_config(s->pio_cmd_clk_offset);
    sm_config_set_out_pins(&cfg, cmd_gpio, 1);
    sm_config_set_in_pins(&cfg, cmd_gpio);
    sm_config_set_set_pins(&cfg, cmd_gpio, 1);
    sm_config_set_jmp_pin(&cfg, cmd_gpio);
    sm_config_set_sideset_pins(&cfg, clk_gpio);
    sm_config_set_out_shift(&cfg, false, true, 32);
    sm_config_set_in_shift(&cfg, false, true, 32);
    sm_config_set_clkdiv(&cfg, clk_div);
    sm_config_set_mov_status(&cfg, STATUS_TX_LESSTHAN, 2);
    pio_sm_init(s->pio, s->cmd_sm, s->pio_cmd_clk_offset, &cfg);
    pio_sm_set_consecutive_pindirs(s->pio, s->cmd_sm, clk_gpio, 1, true);
    pio_sm_set_enabled(s->pio, s->cmd_sm, true);

