kamocat/circuitpython/ports/raspberrypi/common-hal/sdioio/rp2350_sdio.c
    // Data RX program (loaded; SM only enabled during transfers).
    s->pio_data_rx_offset = pio_add_program(s->pio, &sdio_data_rx_program);
    s->pio_cfg_data_rx = sdio_data_rx_program_get_default_config(s->pio_data_rx_offset);
    sm_config_set_in_pins(&s->pio_cfg_data_rx, d0_gpio);
    sm_config_set_in_shift(&s->pio_cfg_data_rx, false, true, 32);
    sm_config_set_out_shift(&s->pio_cfg_data_rx, false, true, 32);
    sm_config_set_clkdiv(&s->pio_cfg_data_rx, clk_div);

    // Data TX program.
    s->pio_data_tx_offset = pio_add_program(s->pio, &sdio_data_tx_program);
    s->pio_cfg_data_tx = sdio_data_tx_program_get_default_config(s->pio_data_tx_offset);
    sm_config_set_in_pins(&s->pio_cfg_data_tx, d0_gpio);
    sm_config_set_set_pins(&s->pio_cfg_data_tx, d0_gpio, 4);
    sm_config_set_out_pins(&s->pio_cfg_data_tx, d0_gpio, 4);
    sm_config_set_in_shift(&s->pio_cfg_data_tx, false, false, 32);
    sm_config_set_out_shift(&s->pio_cfg_data_tx, false, true, 32);
    sm_config_set_clkdiv(&s->pio_cfg_data_tx, clk_div);

    // Disable input synchroniser to reduce latency (CLK is driven synchronously).
    s->pio->input_sync_bypass |=
        (1u << clk_gpio) | (1u << cmd_gpio) |
        (1u << d0_gpio) | (1u << (d0_gpio + 1)) |
        (1u << (d0_gpio + 2)) | (1u << (d0_gpio + 3));

    // Assign GPIO functions.
    gpio_function_t fn = (s->pio == pio1) ? GPIO_FUNC_PIO1 : GPIO_FUNC_PIO0;
    gpio_set_function(cmd_gpio,       fn);
    gpio_set_function(clk_gpio,       fn);
    gpio_set_function(d0_gpio,        fn);
    gpio_set_function(d0_gpio + 1,    fn);
    gpio_set_function(d0_gpio + 2,    fn);
    gpio_set_function(d0_gpio + 3,    fn);

    gpio_set_slew_rate(cmd_gpio,    GPIO_SLEW_RATE_FAST);
    gpio_set_slew_rate(clk_gpio,    GPIO_SLEW_RATE_FAST);
    gpio_set_slew_rate(d0_gpio,     GPIO_SLEW_RATE_FAST);
    gpio_set_slew_rate(d0_gpio + 1, GPIO_SLEW_RATE_FAST);
    gpio_set_slew_rate(d0_gpio + 2, GPIO_SLEW_RATE_FAST);
    gpio_set_slew_rate(d0_gpio + 3, GPIO_SLEW_RATE_FAST);

    // Enable pull-ups on all SDIO lines (required by spec during init).
    gpio_pull_up(cmd_gpio);
    gpio_pull_up(d0_gpio);
    gpio_pull_up(d0_gpio + 1);
    gpio_pull_up(d0_gpio + 2);
    gpio_pull_up(d0_gpio + 3);

    s->transfer_state = SDIO_TRANSFER_IDLE;
    return true;
}

// ---------------------------------------------------------------------------
// Deinit
// ---------------------------------------------------------------------------

void rp2350_sdio_deinit(rp2350_sdio_state_t *s) {
    if (!s->resources_claimed) {
        return;
    }
    rp2350_sdio_stop(s);
    pio_sm_set_enabled(s->pio, s->cmd_sm, false);
    pio_sm_unclaim(s->pio, s->cmd_sm);
    pio_sm_unclaim(s->pio, s->data_sm);
    dma_channel_unclaim((uint)s->dma_ch);
    dma_channel_unclaim((uint)s->dma_chb);

    // Reset GPIO functions.
    gpio_set_function(s->cmd_gpio,       GPIO_FUNC_NULL);
    gpio_set_function(s->clk_gpio,       GPIO_FUNC_NULL);
    gpio_set_function(s->d0_gpio,        GPIO_FUNC_NULL);
    gpio_set_function(s->d0_gpio + 1,    GPIO_FUNC_NULL);
    gpio_set_function(s->d0_gpio + 2,    GPIO_FUNC_NULL);
    gpio_set_function(s->d0_gpio + 3,    GPIO_FUNC_NULL);

    s->resources_claimed = false;
}
